Repository: andgineer/bombard
Catalog: docs/locale/*/LC_MESSAGES/campaign.po
Languages: ru_ru

source: Campaign file
ru_ru: Файл кампании

source: All sections are optional.
ru_ru: Все разделы не являются обязательными.

source: But you need section ``prepare`` or ``ammo`` so Bombard will fire some requests.
ru_ru: Но вам нужен раздел ``prepare`` или ``ammo``, так что Bombard выполнит несколько запросов.

source: Anywhere you can user Python expressions ``{}`` like
ru_ru: Везде, где вы можете использовать выражения Python ``{}`` как

source: Command line arguments available as ``args`` in this expressions. All supply variables - as globals.
ru_ru: Аргументы командной строки доступны как ``args`` в этих выражениях. Все переменные предложения - как глобальные.

source: HTTP parameters
ru_ru: Параметры HTTP

source: All HTTP parameters but URL are optional.
ru_ru: Все параметры HTTP, кроме URL, являются необязательными.

source: Variables you use like ``{name}`` in your requests. Also you can (re)define this variable using ``--supply`` like::
ru_ru: Переменные, которые вы используете как ``{имя}`` в своих запросах. Также вы можете (пере) определить эту переменную используя ``--supply`` наподобие

source: Also you can (re)define it from requests.
ru_ru: Также вы можете (пере) определить его из запросов.

source: If you have ``extract`` section in a request description, it will (re)define ``supply`` variable with the name from this section.
ru_ru: Если в описании запроса есть раздел ``extract``, он (пере) определит переменную ``supply`` с именем из этого раздела.

source: And ``script`` section in request also can (re)define variables.
ru_ru: Раздел ``script`` в запросе также может (пере) определять переменные.

source: Request description
ru_ru: Описание запроса

source: You use this descriptions in sections ``prepare`` and ``ammo`` described below.
ru_ru: Вы используете это описание в разделах ``prepare`` и ``ammo``, описанных ниже.

source: Each request should have ``URL`` and basically that's it. If you need to, you can add other elements like that:
ru_ru: Каждый запрос должен иметь ``URL`` и в принципе этого достаточно. Если вам нужно, вы можете добавить другие элементы, например:

source: Override ``--repeat`` command line option. Number of repetitions for the request.
ru_ru: Переопределить ``--repeat`` параметр командной строки. Количество повторений для запроса.

source: In request you can add section ``script`` with Python3 code. It runs after request.
ru_ru: В запросе вы можете добавить раздел ``script`` с кодом Python3. Он запускается после запроса.

source: It can use ``supply`` object and fire requests with ``reload`` function. Requests definitions from ``ammo`` section available as ``ammo.request_name``.
ru_ru: Он может использовать объект ``supply`` и запускать запросы с функцией ``reload``. Запрашивает определения из раздела ``ammo``, доступные как ``ammo.request_name``.

source: Response to the request is available in ``resp`` object.
ru_ru: Ответ на запрос доступен в объекте ``resp``.

source: In example below we fire requests ``getPost`` from ``ammo`` section for 1st three posts we get in the response:
ru_ru: В приведенном ниже примере мы запускаем запросы ``getPost`` из раздела ``ammo`` для первых трех постов, которые мы получаем в ответе:

source: Also you can place Python code to separate file and use it like this:
ru_ru: Также вы можете поместить код Python в отдельный файл и использовать его следующим образом:

source: If you add this line it mocks all necessary objects and you can use code autocomplete in your IDE:
ru_ru: Если вы добавите эту строку, она проверяет все необходимые объекты, и вы можете использовать автозаполнение кода в вашей IDE:

source: Instead of script you can use section ``extract`` in request. It can contain map of ``name: extract`` pairs. For each pair Bombard will (re)define ``supply`` var with name ``name`` with value extracted from the request response as ``['extract']``.
ru_ru: Вместо скрипта вы можете использовать раздел ``extract`` в запросе. Может содержать карту пар ``name: extract``. Для каждой пары Bombard будет (пере) определять ``supply`` var с именем ``name`` со значением, извлеченным из ответа на запрос как ``['extract']``.

source: If ``extract`` is empty Bombard will use the ``name``, so ``name:`` is the same as ``name: name``.
ru_ru: Если ``extract`` пусто, Bombard будет использовать ``name``, поэтому ``name:`` совпадает с ``name: name``.

source: Also you can use any custom indices you want like that
ru_ru: Также вы можете использовать любые пользовательские индексы, которые вы хотите, например

source: so ``name: ['name']`` is the same as ``name:``.
ru_ru: поэтому ``name: ['name']`` совпадает с ``name:``.

source: If you run Bombard with ``--dry`` it do not make actual HTTP requests. And if you have ``dry`` section in request Bombard will use it as result of this ``dry`` request.
ru_ru: Если вы запускаете Bombard с ``--dry``, он не делает реальных HTTP-запросов. И если у вас есть раздел ``dry`` в запросе, Bombard будет использовать его как результат этого запроса ``dry``.

source: If campaign file has this section, Bombard will start fire with requests from this section.
ru_ru: Если в файле кампании есть этот раздел, Bombard начнет стрелять по запросам из этого раздела.

source: Requests in this section can fire requests from ``ammo`` section, like this:
ru_ru: Запросы в этом разделе могут запускать запросы из раздела ``ammo``, например:

source: As you see above you can send some variable not only to global ``supply`` but just to the request you fire.
ru_ru: Как вы видите выше, вы можете отправить некоторую переменную не только глобальному ``supply``, но и просто на ваш запрос.

source: If ``prepare`` section did not fire any ``ammo`` requests, Bombard after ``prepare`` will fire all requests from ``ammo`` section.
ru_ru: Если в разделе ``prepare`` не было выполнено ни одного запроса ``ammo``, Bombard после ``prepare`` будет запускать все запросы из раздела ``ammo``.

source: So, if you have only ``extract`` sections in ``prepare`` requests. Or if ``scripts`` in ``prepare`` requests do not call ``reload`` to fire requests from ``ammo``. Then Bombard will fire all ``ammo`` requests after ``prepare`` requests.
ru_ru: Итак, если у вас есть только ``extract`` разделы в ``prepare`` запросах. Или если ``scripts`` в запросах ``prepare`` не вызывает ``reload`` для запуска запросов из ``ammo``. Затем Bombard будет запускать все запросы ``ammo`` после запросов ``prepare``.

source: If campaign file do not have ``prepare`` section, Bombard will just fire all requests from this section.
ru_ru: Если в файле кампании нет раздела ``prepare``, Bombard просто запустит все запросы из этого раздела.

source: Each request will be repeated ``--repeat`` times as defined in command line (or by default value for this option).
ru_ru: Каждый запрос будет повторяться ``--repeat`` раз, как указано в командной строке (или по умолчанию для этой опции).

source: Otherwise bombard will fire ``prepare`` section and after that if ``prepare`` requests did not fire any requests from ``ammo``, bombard will fire all requests from ``ammo``.
ru_ru: В противном случае бомбард будет запускать раздел ``prepare``, и после этого, если запросы ``prepare`` не сработали ни одного запроса от ``ammo``, то бомбардировка будет запускать все запросы из ``ammo``.

source: Example of ``ammo`` request for the request that you see in ``prepare`` section:
ru_ru: Пример запроса ``ammo`` для запроса, который вы видите в разделе ``prepare``:
