Repository: andgineer/bombard
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: ru_ru

source: Translation: `Русский <https://bombard.sorokin.engineer/ru/latest/>`_
ru_ru: Перевод: `English <https://bombard.sorokin.engineer/en/latest/>`_

source: Introduction
ru_ru: Вступление

source: Bombard is a tool for stress test and benchmarking your HTTP server. Especially it's good to simulate a heavy load and initial burst of simultaneous HTTP requests with complex logic.
ru_ru: Bombard - это инструмент для стресс-тестирования вашего HTTP-сервера. С его помощью легко и быстро описывать логику формирования запросов.

source: It is designed to be extremely simple yet powerful tool to load test functional behavior.
ru_ru: Он разработан, чтобы быть простым, но мощным инструментом для нагрузочного функционального тестирования.

source: Thanks to optional Python inlines you can fast and easy describe complex logic for the tests.
ru_ru: Благодаря возможности исплоьзовать фрагменты кода Python вы можете легко и быстро описать сложную логику для тестов.

source: Test report shows you how many requests per second your server is capable of serving and with what latency.
ru_ru: Отчет о тестировании показывает, сколько запросов в секунду способен обслуживать ваш сервер и с какой задержкой.

source: Requests description
ru_ru: Описание запросов

source: Requests can be just URL or contain JSON described like this
ru_ru: Минимально в запросе достаточно указать URL, но легко описать и JSON

source: In first request you can get security token as in example above.
ru_ru: В первом запросе вы можете получить токен, как в примере выше.

source: Included examples. To list examples
ru_ru: В приложение втроены примеры. Список встроенных примеров

source: Command line
ru_ru: Командная строка

source: From command line you can change number of threads, loop count, supply vars, customize report and so on.
ru_ru: Из командной строки вы можете изменить количество потоков, количество повторов, переопределить пемеренные, настроить вид отчета и так далее.

source: Also you can bootstrap your own ``bombard.yaml`` file from any example you like::
ru_ru: Также вы можете загрузить свой собственный файл ``bombard.yaml`` из любого понравившегося вам примера

source: Report
ru_ru: отчет

source: Example of report for the command::
ru_ru: Пример отчета для команды

source: Source code
ru_ru: Исходный код

source: Documentation
ru_ru: Документация
